app/controllers/cals_controller.rb

SELECT `cals`.* FROM `cals`
---
	def index
		render status: 200, json: Cal.all

INSERT INTO `cals` (`name`, `description`) VALUES ('hello', 'test1')
---
	def create
		render status: 200, json: Cal.create!(cal_params)

UPDATE `cals` SET `description` = 'James Bond\'s calendar ' WHERE `cals`.`id` = 9
---
	def update
		@cal.update_attributes!(cal_params)

DELETE FROM `cals` WHERE `cals`.`id` = 8
---
	def destroy
		@cal.destroy

SELECT  `cals`.* FROM `cals` WHERE `cals`.`id` = NULL LIMIT 1
---
	def find_cal
		@cal = Cal.find(params[:id])