app/controllers/events_controller.rb

	def create
		event = @events.create!(event_params)
---
INSERT INTO `events` (`name`, `start_time`, `end_time`, `status`, `recurrence`, `cal_id`) VALUES ('Recurring event', '2015-02-06 11:30:00.000000', '2015-02-06 12:00:00.000000', 'cancelled', 'RRULE:FREQ=WEEKLY;BYDAY=MO,TU,WE,TH,FR', 9)

	def update
		update_type = params[:recurring].try(:[],:update_type)
		if @event.non_reccuring_event?
			@event.update_attributes!(event_params)
		elsif update_type == "individual"
			modified_event = find_calendar_events.new(event_params)
			modified_event.recurring_event_id = @event.id
			modified_event.save!
---
UPDATE `events` SET `start_time` = '2015-02-09 08:30:00.000000', `end_time` = '2015-02-09 09:00:00.000000', `recurrence` = 'RRULE:FREQ=WEEKLY;UNTIL=20150209T063000Z;BYDAY=MO,TU,WE,TH,FR' WHERE `events`.`id` = 2
INSERT INTO `events` (`name`, `start_time`, `end_time`, `status`, `recurrence`, `cal_id`, `recurring_event_id`) VALUES ('Recurring event', '2015-02-04 08:30:00.000000', '2015-02-04 09:00:00.000000', 'confirmed', 'RRULE:FREQ=WEEKLY;BYDAY=MO,TU,WE,TH,FR', 9, 2)

	def destroy
		byebug
		events = [@event.destroy]
		render status: 200, json: @event + Event.find_by_recurring_event_id(@event.id).try(:destroy)
---
DELETE FROM `events` WHERE `events`.`id` = 2
SELECT  `events`.* FROM `events` WHERE `events`.`recurring_event_id` = 7 LIMIT 1

	def find_event
		@event = Event.find(params[:id])
---
SELECT  `events`.* FROM `events` WHERE `events`.`id` = NULL LIMIT 1

	def find_calendar_events
		@events = Cal.find(params[:cal_id]).events
---
SELECT  `cals`.* FROM `cals` WHERE `cals`.`id` = 11 LIMIT 1
SELECT `events`.* FROM `events` WHERE `events`.`cal_id` = 11